despacho-arquitectos/app/controllers/almacens_controller.rb

  def index
    @almacens = Almacen.all
---
SELECT "almacens".* FROM "almacens"

  def create
    @almacen = Almacen.new(almacen_params)

    respond_to do |format|
      if @almacen.save
---
INSERT INTO "almacens" ("nombre", "descripcion", "direccion", "codigo_postal", "ciudad", "estado_almacen", "pais", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_almacen
      @almacen = Almacen.find(params[:id])
---
SELECT  "almacens".* FROM "almacens" WHERE "almacens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]