despacho-arquitectos/app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("nombre", "created_at", "updated_at") VALUES (?, ?, ?)  [["nombre", "Obra negra"], ["created_at", "2019-04-10 12:33:19.413565"], ["updated_at", "2019-04-10 12:33:19.413565"]]