despacho-arquitectos/app/controllers/profesional_controller.rb

SELECT DISTINCT "professionals"."especialidad" FROM "professionals"
---
  def index
  	@espe = Professional.select(:especialidad).distinct

INSERT INTO "profesions" ("terceros_idterceros", "nombre_profesion", "created_at", "updated_at") VALUES (?, ?, ?, ?)
INSERT INTO "terceros" ("nombre", "direccion", "codigo_postal", "ciudad", "estado_provincia", "pais", "email", "sitio_web", "telefono", "rfc", "forma_juridica", "estado_tercero", "created_at", "updated_at", "profesionista") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def nuevo
  	nuevo = Tercero.new
	nuevo.nombre = params["nombre"] + " " + params["apellidos"]
	nuevo.profesionista = true
	nuevo.direccion = params["pais"] + " " + params["ciudad"] + " " + params["estado"] + " " + params["direccion"] + " " + "CP " + params["codigo_postal"]
	nuevo.codigo_postal = params["codigo_postal"]
	nuevo.ciudad = params["ciudad"]
	nuevo.estado_provincia = params["estado"]
	nuevo.pais = params["pais"]
	nuevo.email = params["correo"]
	nuevo.sitio_web = params["pagina"]
	nuevo.telefono = params["telefono"]
	nuevo.rfc = params["rfc"]
	nuevo.forma_juridica = params["forma_j"]
	nuevo.estado_tercero = params["estado_tercero"]
	nuevo.save

INSERT INTO "especialidads" ("terceros_idterceros", "nombre_especialidad", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["terceros_idterceros", 2], ["nombre_especialidad", "12 anhos de experiencia en Autocad"], ["created_at", "2019-04-09 04:26:42.083028"], ["updated_at", "2019-04-09 04:26:42.083028"]]
UPDATE "terceros" SET "updated_at" = ?, "profesiones" = ?, "especialidades" = ? WHERE "terceros"."id" = ?
---
		nu = Especialidad.new
		nu.nombre_especialidad = x
		nu.terceros_idterceros = nuevo.id
		nu.save

SELECT "terceros".* FROM "terceros" WHERE (LOWER(direccion) like '%' || LOWER('ags') || '%' ) AND (LOWER(nombre) like '%' || LOWER('Charlie') || '%' ) AND (LOWER(nombre) like '%' || LOWER('Carreon') || '%' )
---
  def mostrar

  	@todos = Tercero.all

SELECT  "terceros".* FROM "terceros" WHERE "terceros"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def editar
  	puts "Los params son"
  	puts params
  	el_id = params["format"]
  	@tercero = Tercero.find(el_id)

SELECT  "terceros".* FROM "terceros" WHERE "terceros"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "terceros" SET "nombre" = ?, "direccion" = ?, "updated_at" = ? WHERE "terceros"."id" = ?  [["nombre", "Charlie Panteras "], ["direccion", "Francia ags ags Francia ags ags Esfuerzo nacional 916 CP 20199 CP 20199"], ["updated_at", "2019-04-09 04:57:40.197921"], ["id", 3]]
---
  def editar_p

  	nuevo = Tercero.find(params["id_tercero"])
	nuevo.nombre = params["nombre"] + " " + params["apellidos"]
	nuevo.profesionista = true
	nuevo.direccion = params["pais"] + " " + params["ciudad"] + " " + params["estado"] + " " + params["direccion"] + " " + "CP " + params["codigo_postal"]
	nuevo.codigo_postal = params["codigo_postal"]
	nuevo.ciudad = params["ciudad"]
	nuevo.estado_provincia = params["estado"]
	nuevo.pais = params["pais"]
	nuevo.email = params["correo"]
	nuevo.sitio_web = params["pagina"]
	nuevo.telefono = params["telefono"]
	nuevo.rfc = params["rfc"]
	nuevo.forma_juridica = params["forma_j"]
	nuevo.estado_tercero = params["estado_tercero"]
	nuevo.save

SELECT  "terceros".* FROM "terceros" WHERE "terceros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "terceros" WHERE "terceros"."id" = ?  [["id", 1]]
---
  def eliminar
  	tercero = Tercero.find(params["format"])
  	tercero.destroy