despacho-arquitectos/app/controllers/provedores_controller.rb

  def nuevo
  	nuevo = Tercero.new
	nuevo.nombre = params["nombre"] + " " + params["apellidos"]
	nuevo.proveedor = true
	nuevo.direccion = params["pais"] + " " + params["ciudad"] + " " + params["estado"] + " " + params["direccion"] + " " + "CP " + params["codigo_postal"]
	nuevo.codigo_postal = params["codigo_postal"]
	nuevo.ciudad = params["ciudad"]
	nuevo.estado_provincia = params["estado"]
	nuevo.pais = params["pais"]
	nuevo.email = params["correo"]
	nuevo.sitio_web = params["pagina"]
	nuevo.telefono = params["telefono"]
	nuevo.rfc = params["rfc"]
	nuevo.forma_juridica = params["forma_j"]
	nuevo.estado_tercero = params["estado_tercero"]


	if nuevo.save
---
INSERT INTO "terceros" ("nombre", "direccion", "codigo_postal", "ciudad", "estado_provincia", "pais", "email", "sitio_web", "telefono", "rfc", "forma_juridica", "estado_tercero", "created_at", "updated_at", "profesionista") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def mostrar

  	@todos = Tercero.all
---
SELECT "terceros".* FROM "terceros" WHERE (LOWER(profesiones) like '%' || LOWER('sistemas') || '%' )

  def editar
  	puts "Los params son"
  	puts params
  	el_id = params["format"]
  	@tercero = Tercero.find(el_id)
---
SELECT  "terceros".* FROM "terceros" WHERE "terceros"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def editar_p

  	nuevo = Tercero.find(params["id_tercero"])
	nuevo.nombre = params["nombre"] + " " + params["apellidos"]
	nuevo.proveedor = true
	nuevo.direccion = params["pais"] + " " + params["ciudad"] + " " + params["estado"] + " " + params["direccion"] + " " + "CP " + params["codigo_postal"]
	nuevo.codigo_postal = params["codigo_postal"]
	nuevo.ciudad = params["ciudad"]
	nuevo.estado_provincia = params["estado"]
	nuevo.pais = params["pais"]
	nuevo.email = params["correo"]
	nuevo.sitio_web = params["pagina"]
	nuevo.telefono = params["telefono"]
	nuevo.rfc = params["rfc"]
	nuevo.forma_juridica = params["forma_j"]
	nuevo.estado_tercero = params["estado_tercero"]

	if nuevo.save
---
SELECT  "terceros".* FROM "terceros" WHERE "terceros"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "terceros" SET "nombre" = ?, "proveedor" = ?, "direccion" = ?, "sitio_web" = ?, "updated_at" = ? WHERE "terceros"."id" = ?  [["nombre", "Neto Contreras "], ["proveedor", "t"], ["direccion", "mex ags asg mex ags asg 12344 CP 123 CP 123"], ["sitio_web", "kyfgfd"], ["updated_at", "2019-04-10 14:33:07.048040"], ["id", 5]]