despacho-arquitectos/app/controllers/services_controller.rb

SELECT "services".* FROM "services"
---
  def index
    @services = Service.all

INSERT INTO "services" ("idservicio", "etiquetaservicio", "estadoventa", "estadocompra", "descripcion", "duracion", "precioventa", "precioventamin", "categoria", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @service = Service.new(service_params)

    respond_to do |format|
      if @service.save

UPDATE "services" SET "estadocompra" = ?, "updated_at" = ? WHERE "services"."id" = ?  [["estadocompra", "fuera de compra"], ["updated_at", "2019-04-10 13:39:34.511440"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @service.update(service_params)

DELETE FROM "services" WHERE "services"."id" = ?  [["id", 1]]
---
  def destroy
    @service.destroy

SELECT  "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_service
      @service = Service.find(params[:id])