despacho-arquitectos/app/controllers/welcome_controller.rb

  	def registrar
  		#nombre = params["NombreMaterial"]
		nuevoMaterial = Prueba.new
		nuevoMaterial.nombre = params["NombreMaterial"]

		#precio = params["PrecioUnitario"]
		nuevoMaterial.precio = params["PrecioUnitario"]

		#categoria = params["Categoria"]
		nuevoMaterial.categoria = params["Categoria"]

		nuevoMaterial.save
---
INSERT INTO "pruebas" ("nombre", "precio", "categoria", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "edede"], ["precio", 1212], ["categoria", "Acabados"], ["created_at", "2019-03-30 06:28:59.918329"], ["updated_at", "2019-03-30 06:28:59.918329"]]